tannewt/circuitpython/ports/espressif/boards/espressif_esp32c5_devkitc_1_n8r4/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2025 Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "ESP32-C5-DevKitC-1-N8R4"
#define MICROPY_HW_MCU_NAME         "ESP32C5"

#define MICROPY_HW_LED_STATUS       (&pin_GPIO27)

#define DEFAULT_UART_BUS_RX         (&pin_GPIO12)
#define DEFAULT_UART_BUS_TX         (&pin_GPIO11)
